import styles from './Details.module.css';

const Details = () => {
    return (
        <>
            <section className={styles['details-section']}>
                <div className={styles['left-sidebar']}>
                    <div className={styles['image']}>
                        <img src="img/when-breath-become-air.jpg" alt="book"></img>
                    </div>
                    <div className={styles['details']}>
                        <h2>И дъхът стана въздух</h2>
                        <span>Автор: Пол Каланити</span>

                        <p>Книгата на Пол Каланити „И дъхът стана въздух“ от издателство Сиела е най-добрият мемоар на 2016 година според читателите в сайта Goodreads и е сред най-добрите книги за 2016 година според The Washington Post и The New York Times.
                            Освен похвалите книгата притежава неумолимото послание на неугасващата надежда за достойно живян живот, в който смъртта е по-лесна за приемане.</p>
                        <button className={styles['favourites']}><i className="far fa-heart"></i> Добави в любими</button>
                    </div>
                </div>
                <div className={styles['right-sidebar']}>
                    <table>
                        <tbody>
                            <tr>
                                <th>Автор</th>
                                <td>Пол Каланити</td>
                            </tr>
                            <tr>
                                <th>Година на издаване</th>
                                <td>2017</td>
                            </tr>
                            <tr>
                                <th>Корица</th>
                                <td>мека</td>
                            </tr>
                            <tr>
                                <th>Страници</th>
                                <td>196</td>
                            </tr>
                            <tr>
                                <th>Език</th>
                                <td>български</td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </section>
            <section className={styles['bottom-bar']}>
                <div className={styles['buttons']}>
                    <button>Пълно описание</button>
                    <button>Мнения</button>
                    <button>Прелисти</button>
                </div>
                <div className={styles['description']}>
                    <p>"Всички животи имат еднаква стойност. Но понякога смъртта е особено жестока. Тази книга ме остави облян в сълзи."

                        Бил Гейтс</p>
                    <p>

                        Пол Каланити не иска да бъде неврохирург като вечно отсъстващия си баща, затова се насочва към литературата и получава магистърска степен
                        по история и философия на науката и медицината в Кеймбридж. Защитата на дисертацията му е върху творчеството на поета Уолт Уитман.
                        Но въпросът за смисъла на живота не спира да го преследва – и отговор той открива именно в лекарското си призвание.


                        Следва десетилетие на неимоверно тежък труд и усърдно учене, докато ръцете му започват да спасяват живот след живот.
                        Пол Каланити се превръща в една от младите звезди на американската неврохирургия. Докато един ден не отива на лекар, който да потвърди диагнозата, която вече сам си е поставил.

                        Рак в напреднал стадий. Пол е само на 36.


                        Докато той и семейството му повеждат отчаяна, безнадеждна битка, той сяда да пише тази книга, която вече е преведена на десетки езици и дава утеха на читателите. Каланити прави равносметка на живота си, на лекарската професия, на моралния си дълг към близките си и своите пациенти. В крайна сметка „И дъхът стана въздух” е много повече от разказ за битката със смъртта – той е за приемането на нашата тленност и за извървяването на пътя докрай с високо вдигната глава.
                    </p>
                    <p>
                        Но макар да не знаех какво искам, бях научил нещо – нещо, което не бях открил у Хипократ, Маймонид или Ослър : задачата на лекаря не е да спаси задължително пациента от смъртта или да го върне към предишния му живот. Не,  тя е да приеме под крилото си болния и неговите близки, когато животът им се разпада, и да работи с тях, докато те се изправят отново на крака и открият какво осмисля живота им.

                        Пол Каланити
                    </p>

                </div>
            </section>
        </>
    );
};

export default Details;